For each of the following questions, formulate a null and alternative hypothesis (be as specific as you can be), then give an example of what a true positive, true negative, type I and type II errors would look like. Note that some of the questions are intentionally phrased in a vague way. It is your job to reword these as more precise questions that could be tested.

# Has the network latency gone up since we switched internet service providers?

    * Null hypothesis(HO) : The network latency have not changes since switching intenet serive provider.
    * Alterative hypothesis(Ha) : Change of internet serive provider has increased our network latency.
    * True Positive : We reject üëçüèª the null hypothesis in favor of alternate hypothesis since the data shows that the network latency has increased after switching providers.
    * True Negative : We fail üëéüèª to reject that the change of provider had the effect of increasing latency.
    * Type I Error : The data shows that network üõú latency have gone up üÜô but it is not true. 
    * Type II Error: The data shows that network latency have not changed but it is not true.

# Is the website redesign any good?

    * Null hypothesis(HO) : Website redesign has not improved user satisfaction .üëéüèª 
    * Alterative hypothesis(Ha) : Website redesign has improved user satisfaction. üëçüèª
    * True Positive : Website redesign shows improvement and we reject null hypothesis in favor of alternative hypothesis. 
    * True negative : Website redesign do not shows up significant improvements and we fail to reject null hypothesis. 
    * Type I Error : Redesigning website do not show any improvements but it is not true. 
    * Type II Error: Redesigning website shows significant improvements but it is not true.

# Is our television ad driving more sales?

    * Null hypothesis(HO) : Driving more Television add has not led to an increased sales.
    * Alterative hypothesis(Ha) : Television ad driving has led to an increase in sales. 
    * True positive : After running ad, sales shows significant increase, and we reject null hypothesis in favor of alternative hypothesis. 
    * True negative : After running ad, sales do not shows significant increase, and we fail to reject null hypothesis.
    * Type I Error : Sales indicate that ad has had positive affect when it has not. 
    * Type II Error : Result indicate that ad has not had a positive effect on sales, when it has.

# 1.Use the following contingency table to help answer the question of whether using a macbook and being a codeup student are independent of each other.

 	                Codeup Student	     Not Codeup Student
                    
          Uses a Macbook	         49              20
   
          Doesn't Use A Macbook	          1	                30

 H0 = using a macbook and being a codeup student are indepndent of each other
 
 Ha = There is significant association between using a macbook and being codeup student.

# 2. Choose another 2 categorical variables from the mpg dataset.

In [28]:
import numpy as np
import pandas as pd

from pydataset import data
from scipy import stats

In [29]:
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

# State your null and alternative hypotheses.

class and drv

class represent the veicle type or class

drv represent the drive type

Null hypothesis(Ho) = There is no association between the vehicle class and the drv type. 

Alternative hypothesis(Ha) = There is significant association between the vehicle class and the drv type.

# State your alpha.

In here suppose we give alpha to 0.01
Accepts 1% chance of making type I error. 
Setting 1% we indicate we want to be 99% confident in our decision to either reject or fail to reject the null hypothesis(Ho)

In [40]:
ct = pd.crosstab(mpg['class'], mpg.drv)

In [41]:
chi, p, degf, exp = stats.chi2_contingency(ct)

In [43]:
a = 0.01
if p < a :
    print('we reject the null hypothesis. There appears to be a relationship.')
else: 
    print('we fail to reject the null hypothesis.')

we reject the null hypothesis. There appears to be a relationship.

# Perform a chi2 test of indepedence.

In [44]:
chi, p, degf, exp = stats.chi2_contingency(ct)

In [45]:
chi

221.60114385352526

In [46]:
p

1.104881117447524e-40

In [47]:
degf

12

In [48]:
exp

array([[ 2.2008547 ,  2.26495726,  0.53418803],
       [20.68803419, 21.29059829,  5.02136752],
       [18.04700855, 18.57264957,  4.38034188],
       [ 4.84188034,  4.98290598,  1.17521368],
       [14.52564103, 14.94871795,  3.52564103],
       [15.40598291, 15.85470085,  3.73931624],
       [27.29059829, 28.08547009,  6.62393162]])

# Use the data from the employees database to answer these questions:
Is an employee's gender independent of whether an employee works in sales or marketing? (only look at current employees)

In [55]:
from sqlalchemy import text, create_engine
import env

In [56]:
url = env.get_connection('employees')

In [57]:
engine = create_engine(url)

In [68]:
query = '''
        SELECT * FROM employees as e
        JOIN dept_emp as DE USING(emp_no)
        JOIN departments as DN USING(dept_no)
        WHERE to_date > CURDATE()
        '''

In [69]:
employee = pd.read_sql(query, engine.connect())
employee

,dept_no,emp_no,birth_date,first_name,last_name,gender,hire_date,from_date,to_date,dept_name
0,d009,10038,1960-07-20,Huan,Lortz,M,1989-09-20,1989-09-20,9999-01-01,Customer Service
1,d009,10049,1961-04-24,Basil,Tramer,F,1992-05-04,1992-05-04,9999-01-01,Customer Service
2,d009,10060,1961-10-15,Breannda,Billingsley,M,1987-11-02,1992-11-11,9999-01-01,Customer Service
3,d009,10088,1954-02-25,Jungsoon,Syrzycki,F,1988-09-02,1992-03-21,9999-01-01,Customer Service
4,d009,10112,1963-08-13,Yuichiro,Swick,F,1985-10-08,1998-05-01,9999-01-01,Customer Service
...,...,...,...,...,...,...,...,...,...,...
240119,d007,499966,1955-12-04,Mihalis,Crabtree,F,1985-06-13,1985-06-13,9999-01-01,Sales
240120,d007,499976,1963-08-20,Guozhong,Felder,M,1988-12-26,1988-12-26,9999-01-01,Sales
240121,d007,499980,1959-06-28,Gino,Usery,M,1991-02-11,1991-02-11,9999-01-01,Sales
240122,d007,499986,1952-07-22,Nathan,Ranta,F,1985-08-11,1985-08-11,9999-01-01,Sales
240123,d007,499987,1961-09-05,Rimli,Dusink,F,1998-09-20,1999-12-21,9999-01-01,Sales

In [80]:
sales_marketing = employee[(employee.dept_name == 'Sales') | (employee.dept_name == 'Marketing')]
sales_marketing.head()

,dept_no,emp_no,birth_date,first_name,last_name,gender,hire_date,from_date,to_date,dept_name
104290,d001,10017,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,1993-08-03,9999-01-01,Marketing
104291,d001,10058,1954-10-01,Berhard,McFarlin,M,1987-04-13,1988-04-25,9999-01-01,Marketing
104292,d001,10140,1957-03-11,Yucel,Auria,F,1991-03-14,1991-03-14,9999-01-01,Marketing
104293,d001,10228,1953-04-21,Karoline,Cesareni,F,1991-08-26,1993-01-28,9999-01-01,Marketing
104294,d001,10239,1955-03-31,Nikolaos,Llado,F,1995-05-08,1996-05-04,9999-01-01,Marketing

In [81]:
sales_marketing_ct = pd.crosstab(sales_marketing.gender, sales_marketing.dept_name)
sales_marketing_ct

dept_name  Marketing  Sales
gender
F               5864  14999
M               8978  22702

In [83]:
chi, p, degf, exp = stats.chi2_contingency(sales_marketing_ct)

In [79]:
chi, p, degf, exp

(221.60114385352526,
 1.104881117447524e-40,
 12,
 array([[ 2.2008547 ,  2.26495726,  0.53418803],
        [20.68803419, 21.29059829,  5.02136752],
        [18.04700855, 18.57264957,  4.38034188],
        [ 4.84188034,  4.98290598,  1.17521368],
        [14.52564103, 14.94871795,  3.52564103],
        [15.40598291, 15.85470085,  3.73931624],
        [27.29059829, 28.08547009,  6.62393162]]))

In [85]:
if p < a:
    print('There is a correlation between gender and working on sales or marketing.')
else:
    print('There is no correlation between gender and working on sales or marketing.')

There is no correlation between gender and working on sales or marketing.